// 霸都丶傲天 2019年10月10日 https://github.com/AJLoveChina/birthday
var config = {
    // 句子的长度可以任意， 你可以写十句话， 二十句话都可以
    // 每句话尽量不要超过15个字,不然展示效果可能不太好
    texts: [
        "送给我",      //这里,每句话结尾的最后一个逗号必须是英文的哦!! 很重要哦!!
        "最好的闺闺小费",  // 同上...
        "今天是你的生日",
        "这是我们认识的",
        "第六年了哦",
        "上一次见面",
        "不就是两个月之前吗",
        "但还是想你",
        "怀念高中每周六的晚上",
        "你我一起在校园中漫步的身影",
        "你是我青春中最美好的回忆❤",
        "希望你越来越好",
        "你值得所有的偏爱",
        "生日快乐呀！🎂"
    ],
    /**
     * imgs 可以不填, 但是如果要填写的话必须遵循下面的格式
     * "对应上面的文字, 要完全一样" : "图片地址, 可以把图片放在imgs文件夹中"
     * 例如
     * "心爱的小可爱": "./imgs/xiaokeai.jpg"
     *
     * 如果不要图片的话, 直接在每行开头写两个斜杠注释即可, 例如下面的 "今天是你的生日" 的图片就不会展示了:)
     * Tip: 图片最好用正方形or接近正方形, 看起来效果更好
     */
    imgs: {
        "最好的闺闺小费": "./imgs/MVIMG_20240120_122025.jpg",
        "不就是两个月之前吗": "./imgs/IMG_20250108_003610.jpg",
        "你是我青春中最美好的回忆❤": "./imgs/IMG_20250108_004816.jpg",
        "你值得所有的偏爱": "./imgs/IMG_20250108_004334.jpg",
        "生日快乐呀！🎂": "./imgs/IMG_20250108_004245.jpg",
        // "今天是你的生日": "./imgs/birthday.jpg",
    },
    // 按钮文字描述, 以下是默认的按钮文字，英文的，您可以改成你喜欢的文字
    desc: {
        turn_on: "开始",
        play: "音乐",
        bannar_coming: "颜色",
        balloons_flying: "好像少点东西",
        cake_fadein: "蛋糕？",
        light_candle: "蜡烛？",
        wish_message: "生日快乐",
        story: "A MESSAGE FOR YOU",
    }
};
